Tekla.Structures.Model.ControlPlaneExtensions
The Tekla.Structures.Model.ControlPlaneExtensions class provides a set of static methods for querying objects of type Tekla.Structures.Model.ControlPlane.

Tekla.Structures.Model.ControlPlaneExtensions.ClosestEdgeTo(Tekla.Structures.Model.ControlPlane,Tekla.Common.Geometry.Vector3)
Gets the closest edge of the controlPlane to the given Tekla.Common.Geometry.Vector3 value.
controlPlane: The Tekla.Structures.Model.ControlPlane to get the closest edge from.
point: The Tekla.Common.Geometry.Vector3 to get the closest edge to.
Returns: The Tekla.Common.Geometry.Segment3 of the given Tekla.Structures.Model.ControlPlane that is closest to the given Tekla.Common.Geometry.Vector3.

Tekla.Structures.Model.ControlPlaneExtensions.GetFace3(Tekla.Structures.Model.ControlPlane)
Gets the Tekla.Structures.Model.ControlPlane as a Tekla.BIM.Geometry.Face3.
controlPlane: The Tekla.Structures.Model.ControlPlane to get the face for.
Returns: The face of the given Tekla.Structures.Model.ControlPlane.

Tekla.Structures.Model.ControlPlaneExtensions.CreateFace(Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Vector3)
Creates a rectangle-shaped face based on three known face corners.
firstCorner: The first corner of the face.
secondCorner: The second corner of the face.
thirdCorner: The third corner of the face.
Returns: The created face.

Tekla.Structures.Model.ControlPlaneExtensions.CalculateOppositeCorner(Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Vector3)
Calculates the corner that is opposite middleCorner.
middleCorner: The middle corner.
previousCorner: The corner before middleCorner.
nextCorner: The corner after middleCorner.
Returns: The calculated corner.